skydivervrn/flysight-2-firmware/STM32_WPAN/App/app_ble.c
static BleApplicationContext_t BleApplicationContext;

Custom_App_ConnHandle_Not_evt_t HandleNotification;

#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
#define SIZE_TAB_CONN_INT            2
float a_ConnInterval[SIZE_TAB_CONN_INT] = {50, 1000}; /* ms */
uint8_t index_con_int, mutex;
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */

/**
 * Advertising Data
 */
uint8_t a_AdvData[15] =
{
  9, AD_TYPE_COMPLETE_LOCAL_NAME, 'F', 'l', 'y', 'S', 'i', 'g', 'h', 't',  /* Complete name */
  4, AD_TYPE_MANUFACTURER_SPECIFIC_DATA, 0xDB, 0x09, 0x00 /* Structure version */,
};

/* USER CODE BEGIN PV */
uint8_t Advertising_mgr_timer_Id;

/* One-shot backoff used to make ENGO discovery self-healing after a transient
 * GAP command failure or an unsuccessful connection-complete event. */
static uint8_t Engo_scan_retry_timer_Id;
static uint8_t engo_scan_retry_pending = 0;

/* Advertising callback */
void (*Adv_Callback)(void) = 0;
void (*Next_Adv_Callback)(void) = 0;

/* Pairing request flag */
uint8_t request_pairing = 0;

/* Link diagnostics for the peripheral role (DISC_EVAL in BLEDIAG.TXT).
 *
 * These used to feed a "poisoned-bond self-heal": two consecutive central
 * links that died without a successful PAIRING_COMPLETE evicted that
 * identity's bond, and four escalated to aci_gap_clear_security_db(). It was
 * written 2026-08-18 for a Mac whose stale LTK kept failing encryption, and
 * it is GONE (2026-08-22) because on this hardware it destroyed healthy phone
 * bonds instead:
 *
 *  - "died fast" was < 3000 ms of HAL_GetTick, and HAL_GetTick STOPS in STOP
 *    mode — on a sleeping logger a link idle for many real minutes still
 *    measures a few hundred awake-ms, so ordinary sessions counted as deaths;
 *  - a central with a stale bond on ITS side (or a user retrying pairing over
 *    and over) produces exactly the streak the counter fed on, and at four
 *    strikes the wipe erased EVERY bond on the device — the tablet's healthy
 *    one included. Net effect in the field: the phone could connect only
 *    right after a fresh pairing, then never again (its CONNECT_IND silently
 *    dropped by the whitelist filter), which is the opposite of what a
 *    self-heal is for.
 *
 * The Mac flashing path this protected is abandoned (owner's decision,
 * 2026-08-21). Bonds are now removed exactly two ways, both deliberate:
 * Reset_BLE: 1 in flysight.txt, or the one-shot wipe on the boot that first
 * adopts the stored identity. A peer that lost its own keys still recovers
 * via ACI_GAP_BOND_LOST -> aci_gap_allow_rebond below. */
static uint8_t central_id_type;         /* identity of the connected central */
static uint8_t central_id_addr[6];
static uint8_t central_id_valid = 0;    /* identity above is populated */
static uint8_t central_pair_ok = 0;     /* PAIR_CPLT status 0 seen on this link */
static uint32_t central_conn_tick = 0;  /* HAL_GetTick at connection complete */

/* The resolving list could not be updated (0x0C, command disallowed: the
 * controller refuses RL changes while scanning or advertising is enabled —
 * BLEDIAG.TXT showed every rebuild failing once the ENGO scan was running).
 * When that happens the scan is terminated, this flag is raised, and
 * Scan_Request retries the rebuild before it starts the next scan. */
static uint8_t resolving_list_dirty = 0;

/* BD Address of device to be connected once discovered */
tBDAddr P2P_SERVER1_BDADDR;
/* Address type of device to be connected (0=public, 1=random, etc.) */
static uint8_t P2P_SERVER1_ADDR_TYPE = GAP_PUBLIC_ADDR;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void BLE_UserEvtRx(void *p_Payload);
static void BLE_StatusNot(HCI_TL_CmdStatus_t Status);
static void Ble_Tl_Init(void);
static void Ble_Hci_Gap_Gatt_Init(void);
static void Adv_Request(APP_BLE_ConnStatus_t NewStatus);
static void Adv_Cancel(void);
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
static void BLE_SVC_L2CAP_Conn_Update(uint16_t ConnectionHandle);
static void Connection_Interval_Update_Req(void);
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */

/* USER CODE BEGIN PFP */
static void LinkConfiguration(void);
static void FS_Adv_Request(APP_BLE_ConnStatus_t NewStatus);
static void Adv_Update_Req(void);
static void Adv_Update(void);
static void APP_BLE_UpdateAdvertisingData(APP_BLE_ConnStatus_t NewStatus);
static int8_t ble_count_bonded_devices(void);
static void Engo_Scan_Retry_Timer(void);
static void Schedule_Engo_Scan_Retry(const char *cause, tBleStatus status);
static void Scan_Request(void);
static void Connect_Request(void);
static void Disconnect_Request(void);
/* USER CODE END PFP */

/* External variables --------------------------------------------------------*/
extern RNG_HandleTypeDef hrng;

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init(void)
{
  SHCI_CmdStatus_t status;
#if (RADIO_ACTIVITY_EVENT != 0)
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
#endif /* RADIO_ACTIVITY_EVENT != 0 */
  /* USER CODE BEGIN APP_BLE_Init_1 */

  /* USER CODE END APP_BLE_Init_1 */
  SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet =
  {
    {{0,0,0}},                          /**< Header unused */
    {0,                                 /** pBleBufferAddress not used */
     0,                                 /** BleBufferSize not used */
     CFG_BLE_NUM_GATT_ATTRIBUTES,
     CFG_BLE_NUM_GATT_SERVICES,
     CFG_BLE_ATT_VALUE_ARRAY_SIZE,
     CFG_BLE_NUM_LINK,
     CFG_BLE_DATA_LENGTH_EXTENSION,
     CFG_BLE_PREPARE_WRITE_LIST_SIZE,
     CFG_BLE_MBLOCK_COUNT,
     CFG_BLE_MAX_ATT_MTU,
     CFG_BLE_PERIPHERAL_SCA,
     CFG_BLE_CENTRAL_SCA,
     CFG_BLE_LS_SOURCE,
     CFG_BLE_MAX_CONN_EVENT_LENGTH,
     CFG_BLE_HSE_STARTUP_TIME,
     CFG_BLE_VITERBI_MODE,
     CFG_BLE_OPTIONS,
     0,
     CFG_BLE_MAX_COC_INITIATOR_NBR,
     CFG_BLE_MIN_TX_POWER,
     CFG_BLE_MAX_TX_POWER,
     CFG_BLE_RX_MODEL_CONFIG,
     CFG_BLE_MAX_ADV_SET_NBR,
     CFG_BLE_MAX_ADV_DATA_LEN,
     CFG_BLE_TX_PATH_COMPENS,
     CFG_BLE_RX_PATH_COMPENS,
     CFG_BLE_CORE_VERSION,
     CFG_BLE_OPTIONS_EXT
    }
  };

  /**
   * Initialize Ble Transport Layer
   */
  Ble_Tl_Init();

  /**
   * Do not allow standby in the application
   */
  UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);

  /**
   * Register the hci transport layer to handle BLE User Asynchronous Events
   */
  UTIL_SEQ_RegTask(1<<CFG_TASK_HCI_ASYNCH_EVT_ID, UTIL_SEQ_RFU, hci_user_evt_proc);

  /**
   * Starts the BLE Stack on CPU2
   */
  status = SHCI_C2_BLE_Init(&ble_init_cmd_packet);
  if (status != SHCI_Success)
  {
    APP_DBG_MSG("  Fail   : SHCI_C2_BLE_Init command, result: 0x%02x\n\r", status);
    /* if you are here, maybe CPU2 doesn't contain STM32WB_Copro_Wireless_Binaries, see Release_Notes.html */
    Error_Handler();
  }
  else
  {
    APP_DBG_MSG("  Success: SHCI_C2_BLE_Init command\n\r");
  }

  /**
   * Initialization of HCI & GATT & GAP layer
   */
  Ble_Hci_Gap_Gatt_Init();

  /**
   * Initialization of the BLE Services
   */
  SVCCTL_Init();

  /**
   * Initialization of the BLE App Context
   */
  BleApplicationContext.SmartPhone_Connection_Status = APP_BLE_IDLE;
  BleApplicationContext.EndDevice_Connection_Status[0] = APP_BLE_IDLE;
  BleApplicationContext.EndDevice1Found = 0x00;

  /**
   * From here, all initialization are BLE application specific
   */

  UTIL_SEQ_RegTask(1<<CFG_TASK_ADV_CANCEL_ID, UTIL_SEQ_RFU, Adv_Cancel);

  /* USER CODE BEGIN APP_BLE_Init_4 */
  UTIL_SEQ_RegTask(1<<CFG_TASK_LINK_CONFIG_ID, UTIL_SEQ_RFU, LinkConfiguration);
  UTIL_SEQ_RegTask(1<<CFG_TASK_ADV_UPDATE_ID, UTIL_SEQ_RFU, Adv_Update);
  UTIL_SEQ_RegTask(1<<CFG_TASK_START_SCAN_ID, UTIL_SEQ_RFU, Scan_Request);
  UTIL_SEQ_RegTask(1<<CFG_TASK_CONN_DEV_1_ID, UTIL_SEQ_RFU, Connect_Request);
  UTIL_SEQ_RegTask(1<<CFG_TASK_DISCONN_DEV_1_ID, UTIL_SEQ_RFU, Disconnect_Request);
  /* USER CODE END APP_BLE_Init_4 */

  /**
   * Initialization of ADV - Ad Manufacturer Element - Support OTA Bit Mask
   */
#if (RADIO_ACTIVITY_EVENT != 0)
  ret = aci_hal_set_radio_activity_mask(0x0006);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_hal_set_radio_activity_mask command, result: 0x%x \n\r", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_hal_set_radio_activity_mask command\n\r");
  }
#endif /* RADIO_ACTIVITY_EVENT != 0 */

#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
  index_con_int = 0;
  mutex = 1;
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */

  /**
   * Initialize Custom Template Application
   */
  Custom_APP_Init();

