skydivervrn/flysight-2-firmware/STM32_WPAN/App/app_ble.c
          /* USER CODE BEGIN EVT_LE_CONN_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_CONN_UPDATE_COMPLETE */
          break;

        case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
          /* With privacy disabled the controller reports the shorter legacy
           * Connection Complete event. The old code handled only Enhanced
           * Connection Complete, so the link existed but its handle was never
           * recorded: disconnect was classified as peer=other and advertising
           * was never restarted. Normalize both event layouts below. */
          p_connection_complete_event =
              (hci_le_connection_complete_event_rp0 *) p_meta_evt->data;
          connection_status = p_connection_complete_event->Status;
          connection_handle = p_connection_complete_event->Connection_Handle;
          role = p_connection_complete_event->Role;
          peer_address_type = p_connection_complete_event->Peer_Address_Type;
          peer_address = p_connection_complete_event->Peer_Address;
          peer_rpa = no_peer_rpa;
          connection_interval = p_connection_complete_event->Conn_Interval;
          supervision_timeout = p_connection_complete_event->Supervision_Timeout;
          goto connection_complete_common;

        case HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE:
          p_enhanced_connection_complete_event = (hci_le_enhanced_connection_complete_event_rp0 *) p_meta_evt->data;
          /**
           * The connection is done, there is no need anymore to schedule the LP ADV
           */

          connection_status = p_enhanced_connection_complete_event->Status;
          connection_handle = p_enhanced_connection_complete_event->Connection_Handle;
          role = p_enhanced_connection_complete_event->Role;
          peer_address_type = p_enhanced_connection_complete_event->Peer_Address_Type;
          peer_address = p_enhanced_connection_complete_event->Peer_Address;
          peer_rpa = p_enhanced_connection_complete_event->Peer_Resolvable_Private_Address;
          connection_interval = p_enhanced_connection_complete_event->Conn_Interval;
          supervision_timeout = p_enhanced_connection_complete_event->Supervision_Timeout;

connection_complete_common:

#if FS_BLE_DIAG
          /* Record 4, the first half — and the single most informative line in
           * the file for this bug. role=1 is us as PERIPHERAL, i.e. a phone or
           * the Mac got past the whitelist filter. peer_type 0x00/0x01 is a plain
           * public/random identity; 0x02/0x03 mean the controller RESOLVED the
           * peer's private address against the resolving list, so peer_addr is
           * the identity behind it and peer_rpa is what was actually on the air.
           * A phone that only ever gets in after a double-press should show
           * peer_type 0x01 with a peer_rpa-shaped address here — that is the
           * signature of "known device, unresolvable identity". */
          {
            char idStr[18], rpaStr[18];
            FS_BleDiag_FormatAddr(idStr, sizeof(idStr), peer_address);
            FS_BleDiag_FormatAddr(rpaStr, sizeof(rpaStr), peer_rpa);
            FS_BleDiag_Log("CONN st=0x%02X role=%u handle=0x%04X ptype=%u paddr=%s",
                (unsigned) connection_status,
                (unsigned) role, (unsigned) connection_handle,
                (unsigned) peer_address_type,
                idStr);
            FS_BleDiag_Log("CONN handle=0x%04X peer_rpa=%s int=%u to=%u",
                (unsigned) connection_handle, rpaStr,
                (unsigned) connection_interval,
                (unsigned) supervision_timeout);
          }
#endif

          /* A failed connection complete is still an event, but it does not
           * carry a usable handle.  The generated template used to fall
           * through and mark the ENGO client CONNECTED forever, after which no
           * further scan was possible.  This is especially easy to hit while
           * the glasses are changing to Searching after ACTIVE -> SLEEP. */
          if (connection_status != BLE_STATUS_SUCCESS)
          {
            /* BLEDIAG is off by default, so the same fact goes to EVENT.CSV,
             * which is the log anyone reads after a flight. */
            FS_Log_WriteEventAsync("ENGO GATT setup failed: connection complete 0x%02X",
                (unsigned) connection_status);
            FS_BleDiag_Log("ENGO conn complete FAILED st=0x%02X role=%u state=%u run=%u",
                (unsigned) connection_status, (unsigned) role,
                (unsigned) BleApplicationContext.EndDevice_Connection_Status[0],
                (unsigned) FS_ActiveLook_IsRunning());

            /* On a failed LE Connection Complete the spec does not guarantee
             * that Role/peer fields are meaningful. Our own state is the safe
             * discriminator: CONNECTING exists only for the outgoing ENGO
             * create-connection procedure. */
            if (BleApplicationContext.EndDevice_Connection_Status[0] == APP_BLE_CONNECTING)
            {
              BleApplicationContext.EndDevice_Connection_Status[0] = APP_BLE_IDLE;
              BleApplicationContext.connectionHandleEndDevice1 = 0xFFFF;
              BleApplicationContext.EndDevice1Found = 0x00;
              Schedule_Engo_Scan_Retry("conn-event", connection_status);
            }
            else if (FS_State_Get()->enable_ble)
            {
              /* An unsuccessful incoming peripheral connection leaves no
               * phone link. Restore ordinary advertising as a precaution. */
              BleApplicationContext.SmartPhone_Connection_Status = APP_BLE_IDLE;
              BleApplicationContext.connectionHandleCentral = 0xFFFF;
              FS_Adv_Request(APP_BLE_FAST_ADV);
            }
            break;
          }

          if (role == 0x00)
          { /* ROLE CENTRAL */
            APP_DBG_MSG("-- CONNECTION SUCCESS WITH END DEVICE 1\n\r");
            BleApplicationContext.EndDevice_Connection_Status[0] = APP_BLE_CONNECTED;
            BleApplicationContext.connectionHandleEndDevice1 = connection_handle;
            if (FS_ActiveLook_IsRunning())
            {
              /* Arm the setup watchdog before discovery starts, so a sequence
               * that never completes cannot hold the glasses' only central
               * slot indefinitely. */
              FS_ActiveLook_OnDiscoveryStart();
              FS_ActiveLook_Client_StartDiscovery(connection_handle);
            }
            else
            {
              /* Scan/connect may have completed after ACTIVE teardown. Do not
               * discover or draw; drop this late link immediately. */
              (void)aci_gap_terminate(connection_handle, 0x13);
            }
          }
          else
          {
            APP_DBG_MSG("-- CONNECTION SUCCESS WITH SMART PHONE\n\r");
            BleApplicationContext.SmartPhone_Connection_Status = APP_BLE_CONNECTED;
            BleApplicationContext.connectionHandleCentral = connection_handle;

            /* Remember who this is, for the poisoned-bond self-heal at
             * disconnect. Types 0x02/0x03 mean the controller already resolved
             * a private address: Peer_Address then IS the identity, of type
             * public (0x00) or static-random (0x01) respectively — the same
             * form the bonding table stores. */
            central_id_type = peer_address_type;
            if (central_id_type >= 0x02)
            {
              central_id_type -= 0x02;
            }
            memcpy(central_id_addr, peer_address, 6);
            central_id_valid = 1;
            central_pair_ok = 0;
            central_conn_tick = HAL_GetTick();
            HandleNotification.Custom_Evt_Opcode = CUSTOM_CONN_HANDLE_EVT;
            HandleNotification.ConnectionHandle = connection_handle;
            Custom_APP_Notification(&HandleNotification);

