skydivervrn/flysight-2-firmware/STM32_WPAN/App/app_ble.c
/* USER CODE END Adv_Request_1*/

  /* Update Advertising data */
  ret = aci_gap_update_adv_data(sizeof(a_AdvData), (uint8_t*) a_AdvData);
  if (ret != BLE_STATUS_SUCCESS)
  {
      APP_DBG_MSG("==>> Start Fast Advertising Failed , result: %d \n\r", ret);
  }
  else
  {
      APP_DBG_MSG("==>> Success: Start Fast Advertising \n\r");
  }

  return;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTION */

/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 * SPECIFIC FUNCTIONS FOR CUSTOM
 *
 *************************************************************/
static void Adv_Cancel(void)
{
  /* USER CODE BEGIN Adv_Cancel_1 */

  /* USER CODE END Adv_Cancel_1 */

  if (BleApplicationContext.SmartPhone_Connection_Status != APP_BLE_CONNECTED)
  {
    tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

    ret = aci_gap_set_non_discoverable();

    BleApplicationContext.SmartPhone_Connection_Status = APP_BLE_IDLE;
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("** STOP ADVERTISING **  Failed \r\n\r");
    }
    else
    {
      APP_DBG_MSG("  \r\n\r");
      APP_DBG_MSG("** STOP ADVERTISING **  \r\n\r");
    }

    FS_BleDiag_Log("ADV path=stop set_non_discoverable=0x%02X", (unsigned) ret);
  }

  /* USER CODE BEGIN Adv_Cancel_2 */

  /* USER CODE END Adv_Cancel_2 */

  return;
}

#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
void BLE_SVC_L2CAP_Conn_Update(uint16_t ConnectionHandle)
{
  /* USER CODE BEGIN BLE_SVC_L2CAP_Conn_Update_1 */

  /* USER CODE END BLE_SVC_L2CAP_Conn_Update_1 */

  if (mutex == 1)
  {
    mutex = 0;
    index_con_int = (index_con_int + 1)%SIZE_TAB_CONN_INT;
    uint16_t interval_min = CONN_P(a_ConnInterval[index_con_int]);
    uint16_t interval_max = CONN_P(a_ConnInterval[index_con_int]);
    uint16_t peripheral_latency = L2CAP_PERIPHERAL_LATENCY;
    uint16_t timeout_multiplier = L2CAP_TIMEOUT_MULTIPLIER;
    tBleStatus ret;

    ret = aci_l2cap_connection_parameter_update_req(BleApplicationContext.connectionHandleCentral,
                                                    interval_min, interval_max,
                                                    peripheral_latency, timeout_multiplier);
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Failed \r\n\r");
    }
    else
    {
      APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Successfully \r\n\r");
    }
  }

  /* USER CODE BEGIN BLE_SVC_L2CAP_Conn_Update_2 */

  /* USER CODE END BLE_SVC_L2CAP_Conn_Update_2 */

  return;
}
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */

#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
static void Connection_Interval_Update_Req(void)
{
  if (BleApplicationContext.SmartPhone_Connection_Status != APP_BLE_FAST_ADV && BleApplicationContext.SmartPhone_Connection_Status != APP_BLE_IDLE)
  {
    BLE_SVC_L2CAP_Conn_Update(BleApplicationContext.connectionHandleCentral);
  }

  return;
}
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */

/* USER CODE BEGIN FD_SPECIFIC_FUNCTIONS */
static void LinkConfiguration(void)
{
  tBleStatus status;

  /* See AN5289: How to maximize data throughput */
  APP_DBG_MSG("set data length \n");
  status = hci_le_set_data_length(BleApplicationContext.connectionHandleCentral,251,2120);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("set data length command error \n");
  }
}

static void FS_Adv_Request(APP_BLE_ConnStatus_t NewStatus)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  uint16_t Min_Inter, Max_Inter;
  int8_t bonded;

  /* ===== GATEKEEPER: Single point of enforcement ===== */
  if (!FS_State_Get()->enable_ble)
  {
    /* Ensure radio is off and state is consistent */
    if ((BleApplicationContext.SmartPhone_Connection_Status == APP_BLE_FAST_ADV)
        || (BleApplicationContext.SmartPhone_Connection_Status == APP_BLE_LP_ADV))
    {
      aci_gap_set_non_discoverable();
    }
    HW_TS_Stop(Advertising_mgr_timer_Id);
    BleApplicationContext.SmartPhone_Connection_Status = APP_BLE_IDLE;
    FS_BleDiag_Log("ADV path=none reason=enable_ble=0");
    return;
  }
  /* ===== END GATEKEEPER ===== */

  if (NewStatus == APP_BLE_FAST_ADV)
  {
    Min_Inter = CFG_FAST_CONN_ADV_INTERVAL_MIN;
    Max_Inter = CFG_FAST_CONN_ADV_INTERVAL_MAX;
  }
  else
  {
    Min_Inter = CFG_LP_CONN_ADV_INTERVAL_MIN;
    Max_Inter = CFG_LP_CONN_ADV_INTERVAL_MAX;
  }

  /**
   * Stop the timer, it will be restarted for a new shot
   * It does not hurt if the timer was not running
   */
  HW_TS_Stop(Advertising_mgr_timer_Id);

  if ((BleApplicationContext.SmartPhone_Connection_Status == APP_BLE_FAST_ADV)
      || (BleApplicationContext.SmartPhone_Connection_Status == APP_BLE_LP_ADV))
  {
    /* Connection in ADVERTISE mode have to stop the current advertising */
    ret = aci_gap_set_non_discoverable();
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_set_non_discoverable - Stop Advertising Failed , result: %d \n", ret);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_set_non_discoverable - Successfully Stopped Advertising \n");
    }
  }

  /* Call advertising callback */
  if (Adv_Callback) Adv_Callback();

  /* Update advertising callback */
  Adv_Callback = Next_Adv_Callback;
  Next_Adv_Callback = 0;

  BleApplicationContext.SmartPhone_Connection_Status = NewStatus;

  /**
   * Prepare white list as described in PM0271 5.3.1
   */
  bonded = ble_count_bonded_devices();
  (void) bonded;  /* only read by the FS_BLE_DIAG records below */

  if (request_pairing)
  {
    /* Start Fast or Low Power Advertising */
    ret = aci_gap_set_limited_discoverable(ADV_IND,
                                           Min_Inter,
                                           Max_Inter,
                                           CFG_BLE_ADDRESS_TYPE,
                                           ADV_FILTER,
                                           0,
                                           0,
                                           0,
                                           0,
                                           0,
                                           0);
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_set_limited_discoverable - fail, result: 0x%x \n", ret);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_set_limited_discoverable - Success\n");
    }

    /* Record 5, path A: the double-press path. ADV_FILTER is NO_WHITE_LIST_USE,
     * so this advertising is open to anyone — which is why a double-press always
     * gets in and is NOT evidence that the bond database is healthy. */
    FS_BleDiag_Log("ADV path=limited_discoverable filter=%u ret=0x%02X status=%u"
                   " bonds=%d int=%u-%u",
        (unsigned) ADV_FILTER, (unsigned) ret, (unsigned) NewStatus, (int) bonded,
        (unsigned) Min_Inter, (unsigned) Max_Inter);

