skydivervrn/flysight-2-firmware/STM32_WPAN/App/app_ble.c
    /* Update advertising data */
    APP_BLE_UpdateAdvertisingData(NewStatus);
  }
  else
  {
    /* Start Fast or Low Power Advertising */
    ret = aci_gap_set_undirected_connectable(Min_Inter,
                                             Max_Inter,
                                             CFG_BLE_ADDRESS_TYPE,
                                             ADV_FILTER);
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_set_undirected_connectable - fail, result: 0x%x \n", ret);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_set_undirected_connectable - Success\n");
    }

    /* Keep the logger on its stable random identity address. Android 13 did
     * not retain the local IRK when the bond was originally created while
     * privacy was disabled; switching a live installation to RPA advertising
     * consequently made the same FlySight look like a new device after every
     * reboot. The GATT security requirements still enforce pairing/bonding;
     * this filter only controls who may establish the otherwise inert link. */
    FS_BleDiag_Log("ADV path=undirected_connectable filter=0x%02X ret=0x%02X status=%u"
                   " bonds=%d int=%u-%u",
        (unsigned) ADV_FILTER, (unsigned) ret,
        (unsigned) NewStatus, (int) bonded, (unsigned) Min_Inter, (unsigned) Max_Inter);

    /* Update advertising data */
    APP_BLE_UpdateAdvertisingData(NewStatus);
  }

  if (NewStatus == APP_BLE_FAST_ADV)
  {
    HW_TS_Start(Advertising_mgr_timer_Id, FAST_ADV_TIMEOUT);
  }

  return;
}

static void Adv_Update_Req(void)
{
  /**
   * The code shall be executed in the background as an aci command may be sent
   * The background is the only place where the application can make sure a new aci command
   * is not sent if there is a pending one
   */
  UTIL_SEQ_SetTask(1 << CFG_TASK_ADV_UPDATE_ID, CFG_SCH_PRIO_1);
}

static void Adv_Update(void)
{
  FS_Adv_Request(APP_BLE_LP_ADV);
}

void APP_BLE_RequestPairing(void (*Callback)(void))
{
  /* Prepare for pairing request */
  Next_Adv_Callback = Callback;
  request_pairing = 1;

  /* Request fast advertising */
  FS_Adv_Request(APP_BLE_FAST_ADV);
}

void APP_BLE_CancelPairing(void)
{
  /* Prepare for pairing request */
  Next_Adv_Callback = 0;
  request_pairing = 0;

  if (BleApplicationContext.SmartPhone_Connection_Status == APP_BLE_FAST_ADV)
  {
    /* Request low power advertising */
    FS_Adv_Request(APP_BLE_LP_ADV);
  }
}

void APP_BLE_UpdateDeviceName(void)
{
  /**
   * For details of Bluetooth device name characteristic, see:
   * https://www.bluetooth.com/specifications/css-11/
   */

  const char *name = FS_State_Get()->device_name;
  const size_t name_len = strlen(name);
  uint8_t char_length;
  tBleStatus ret;

  if (BleApplicationContext.BleApplicationContext_legacy.gapServiceHandle)
  {
    /* Get device name length */
    char_length = MIN(name_len, 30);

    /* Update device name characteristic */
    ret = aci_gatt_update_char_value(
        BleApplicationContext.BleApplicationContext_legacy.gapServiceHandle,
        BleApplicationContext.BleApplicationContext_legacy.devNameCharHandle,
        0,
        char_length, (uint8_t *) name);
    if (ret != BLE_STATUS_SUCCESS)
    {
      BLE_DBG_SVCCTL_MSG("  Fail   : aci_gatt_update_char_value - Device Name\n");
    }
    else
    {
      BLE_DBG_SVCCTL_MSG("  Success: aci_gatt_update_char_value - Device Name\n");
    }
  }

  /* Update advertising data */
  APP_BLE_UpdateAdvertisingData(BleApplicationContext.SmartPhone_Connection_Status);
}

void APP_BLE_Reset(void)
{
  tBleStatus ret;

  /* Clear list of bonded devices */
  ret = aci_gap_clear_security_db();
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_gap_clear_security_db command, result: 0x%x \n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_gap_clear_security_db command\n");
  }

  /* Record 1, the part that matters: this line IS the bond wipe. If it appears
   * without the owner having asked for it, that is the bug. */
  FS_BleDiag_Log("BLE_RESET clear_security_db=0x%02X (ALL BONDS ERASED)", (unsigned) ret);

  /* Re-initialize advertising */
  FS_Adv_Request(BleApplicationContext.SmartPhone_Connection_Status);
}
static void APP_BLE_UpdateAdvertisingData(APP_BLE_ConnStatus_t NewStatus)
{
  /**
   * For details of Bluetooth advertised local name, see:
   * https://www.bluetooth.com/specifications/css-11/
   */

  const char *name = FS_State_Get()->device_name;
  const size_t name_len = strlen(name);
  uint8_t mfg_data[] = { 4, AD_TYPE_MANUFACTURER_SPECIFIC_DATA, 0xDB, 0x09, 0x00 };
  uint8_t adv_data[31];
  uint8_t k = 0;
  uint8_t ad_length;
  uint8_t ad_type;
  tBleStatus ret;

  if ((NewStatus == APP_BLE_FAST_ADV) || (NewStatus == APP_BLE_LP_ADV))
  {
    /* Set flag in manufacturer specific data */
    mfg_data[4] = request_pairing;

    /* Copy manufacturer specific data */
    memcpy(&(adv_data[k]), mfg_data, sizeof(mfg_data));
    k += sizeof(mfg_data);

    /* Get short local name if needed */
    if (name_len > sizeof(adv_data) - k - 2)
    {
      ad_length = sizeof(adv_data) - k - 2;
      ad_type = AD_TYPE_SHORTENED_LOCAL_NAME;
    }
    else
    {
      ad_length = name_len;
      ad_type = AD_TYPE_COMPLETE_LOCAL_NAME;
    }

    /* Copy local name */
    adv_data[k++] = 1 + ad_length;
    adv_data[k++] = ad_type;
    memcpy(&(adv_data[k]), name, ad_length);
    k += ad_length;

    /* Update advertising data */
    ret = aci_gap_update_adv_data(k, adv_data);
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_update_adv_data - fail, result: 0x%x \n", ret);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_update_adv_data - Success\n");
    }
  }
}

static int8_t ble_count_bonded_devices(void)
{
  uint8_t total = 0;
  tBleStatus ret;
  Bonded_Device_Entry_t devices[16];
  Identity_Entry_t rl_entries[16];
#if FS_BLE_DIAG
  char addrStr[18];
#endif

  // 1) Rebuild the whitelist from the bonding database (PM0271 5.3.1 step 3)
  ret = aci_gap_configure_whitelist();
  APP_DBG_MSG("\taci_gap_configure_whitelist = 0x%02X\r\n", ret);
  FS_BleDiag_Log("WL configure_whitelist=0x%02X", (unsigned) ret);

  // 2) Fetch bonded identities (PM0271 5.3.1 step 4)
  ret = aci_gap_get_bonded_devices(&total, devices);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("ACI_GAP_GET_BONDED_DEVICES error %x\r\n", ret);
    FS_BleDiag_Log("WL get_bonded=0x%02X FAILED", (unsigned) ret);
    return -1;
  }

