skydivervrn/flysight-2-firmware/STM32_WPAN/App/app_ble.c
  if (total == 0)
  {
    APP_DBG_MSG("No previous bonded devices\r\n");
  }

  /* Record 2's answer in one line: n=0 with the whitelist filter armed means
   * nothing on earth can connect without a double-press. */
  FS_BleDiag_Log("WL get_bonded=0x%02X n=%u", (unsigned) ret, (unsigned) total);

  for (uint8_t k = 0; k < total; k++)
  {
    // Log for visibility
    APP_DBG_MSG("Bonded %u/%u - %s %02X:%02X:%02X:%02X:%02X:%02X\r\n",
                k + 1, total,
                devices[k].Address_Type == 0 ? "Public" : "Random",
                devices[k].Address[5], devices[k].Address[4], devices[k].Address[3],
                devices[k].Address[2], devices[k].Address[1], devices[k].Address[0]);

#if FS_BLE_DIAG
    /* Address TYPE matters as much as the address: the identity the controller
     * stored has to be the identity the peer presents behind its resolvable
     * private address, and a public/random mix-up resolves to nothing. */
    FS_BleDiag_FormatAddr(addrStr, sizeof(addrStr), devices[k].Address);
    FS_BleDiag_Log("BOND %u/%u type=%u addr=%s",
        (unsigned) (k + 1), (unsigned) total,
        (unsigned) devices[k].Address_Type, addrStr);
#endif

    rl_entries[k].Peer_Identity_Address_Type = devices[k].Address_Type;
    memcpy(rl_entries[k].Peer_Identity_Address, devices[k].Address, 6);
  }

  // 3) Add bonded identities to resolving list (PM0271 5.3.1 step 5)
  ret = aci_gap_add_devices_to_resolving_list(total, rl_entries, 1);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("aci_gap_add_devices_to_resolving_list fail %x\r\n", ret);
    FS_BleDiag_Log("RL add_devices=0x%02X n=%u FAILED", (unsigned) ret, (unsigned) total);

    /* 0x0C, command disallowed: the controller refuses resolving-list changes
     * while scanning is enabled (BT spec; adv is already stopped on this
     * path). Seen constantly in BLEDIAG.TXT once the ENGO scan was running —
     * which meant a bond made after boot never reached the RL, so that phone's
     * private address stopped resolving and its whitelist reconnects were
     * refused until the next reboot. Terminate the scan and let Scan_Request
     * redo the rebuild before it starts the next one. */
    if (ret == HCI_COMMAND_DISALLOWED_ERR_CODE && !resolving_list_dirty)
    {
      resolving_list_dirty = 1;
      ret = aci_gap_terminate_gap_proc(GAP_GENERAL_DISCOVERY_PROC);
      FS_BleDiag_Log("RL retry: terminate_scan=0x%02X", (unsigned) ret);
      if (ret != BLE_STATUS_SUCCESS)
      {
        /* No scan to stop after all — retry the rebuild on the spot. */
        resolving_list_dirty = 0;
        ret = aci_gap_add_devices_to_resolving_list(total, rl_entries, 1);
        FS_BleDiag_Log("RL add_devices=0x%02X n=%u (retry)",
                       (unsigned) ret, (unsigned) total);
        if (ret == BLE_STATUS_SUCCESS)
        {
          return (int8_t)total;
        }
      }
      /* else: ACI_GAP_PROC_COMPLETE restarts the scan task, and Scan_Request
       * finishes the rebuild first. */
    }
    return -1;
  }

  APP_DBG_MSG("Resolving List populated with %u bonded device(s)\r\n", total);
  FS_BleDiag_Log("RL add_devices=0x%02X n=%u", (unsigned) ret, (unsigned) total);
  return (int8_t)total;
}

/* Timer callbacks only wake the sequencer; all HCI commands and diagnostics
 * stay in task context. */
static void Engo_Scan_Retry_Timer(void)
{
  engo_scan_retry_pending = 0;
  if (FS_ActiveLook_IsRunning())
    UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_0);
}

static void Schedule_Engo_Scan_Retry(const char *cause, tBleStatus status)
{
  if (!FS_ActiveLook_IsRunning())
    return;

  if (!engo_scan_retry_pending)
  {
    engo_scan_retry_pending = 1;
    FS_BleDiag_Log("ENGO scan retry cause=%s status=0x%02X",
                   cause, (unsigned) status);
    HW_TS_Start(Engo_scan_retry_timer_Id, ENGO_SCAN_RETRY_TIMEOUT);
  }
}

/**
 * @brief  Scan Request
 * @param  None
 * @retval None
 */
static void Scan_Request(void)
{
  /* USER CODE BEGIN Scan_Request_1 */

  /* A resolving-list rebuild was refused with "command disallowed" because
   * this scan was running. Now — after the terminated scan's PROC_COMPLETE and
   * before the next one starts — is the moment it can succeed. When
   * advertising is up too (it also blocks RL changes), FS_Adv_Request redoes
   * the whole stop-rebuild-restart cycle; with the scan not yet running, the
   * rebuild inside it goes through. */
  if (resolving_list_dirty)
  {
    resolving_list_dirty = 0;
    if ((BleApplicationContext.SmartPhone_Connection_Status == APP_BLE_FAST_ADV)
        || (BleApplicationContext.SmartPhone_Connection_Status == APP_BLE_LP_ADV))
    {
      FS_Adv_Request(BleApplicationContext.SmartPhone_Connection_Status);
    }
    else
    {
      (void) ble_count_bonded_devices();
    }
  }

  /* USER CODE END Scan_Request_1 */
  tBleStatus result;

  /* Another event may have made a retry unnecessary before its backoff
   * expired. There must never be a stale timer left to interrupt a good scan. */
  if (engo_scan_retry_pending)
  {
    HW_TS_Stop(Engo_scan_retry_timer_Id);
    engo_scan_retry_pending = 0;
  }

  /* Queued scan tasks can outlive ACTIVE mode. The gate is checked here, at
   * execution time, so stale work cannot reconnect to glasses while inactive. */
  if (!FS_ActiveLook_IsRunning())
  {
    BleApplicationContext.EndDevice1Found = 0x00;
    return;
  }

  if (BleApplicationContext.EndDevice_Connection_Status[0] != APP_BLE_CONNECTED)
  {
    /* USER CODE BEGIN APP_BLE_CONNECTED */
    BleApplicationContext.EndDevice1Found = 0x00;
    /* USER CODE END APP_BLE_CONNECTED */
    result = aci_gap_start_general_discovery_proc(SCAN_P,
                                                  SCAN_L,
                                                  CFG_BLE_ADDRESS_TYPE,
                                                  1);
    FS_BleDiag_Log("ENGO scan start=0x%02X state=%u run=%u",
                   (unsigned) result,
                   (unsigned) BleApplicationContext.EndDevice_Connection_Status[0],
                   (unsigned) FS_ActiveLook_IsRunning());
    if (result == BLE_STATUS_SUCCESS)
    {
    /* USER CODE BEGIN BLE_SCAN_SUCCESS */

    /* USER CODE END BLE_SCAN_SUCCESS */
      APP_DBG_MSG(" \r\n\r** START GENERAL DISCOVERY (SCAN) **  \r\n\r");
    }
    else
    {
    /* USER CODE BEGIN BLE_SCAN_FAILED */

    /* USER CODE END BLE_SCAN_FAILED */
      APP_DBG_MSG("-- BLE_App_Start_Limited_Disc_Req, Failed %02x \r\n\r", result);
      Schedule_Engo_Scan_Retry("scan-cmd", result);
    }
  }
  /* USER CODE BEGIN Scan_Request_2 */

  /* USER CODE END Scan_Request_2 */

  return;
}

/**
 * @brief  Connection Establishement on SERVER 1
 * @param  None
 * @retval None
 */
static void Connect_Request(void)
{
  tBleStatus result;
  APP_DBG_MSG("\r\n\r** CREATE CONNECTION TO END DEVICE 1 **  \r\n\r");
  if (!FS_ActiveLook_IsRunning())
  {
    BleApplicationContext.EndDevice1Found = 0x00;
    BleApplicationContext.EndDevice_Connection_Status[0] = APP_BLE_IDLE;
    return;
  }
  if (BleApplicationContext.EndDevice_Connection_Status[0] != APP_BLE_CONNECTED &&
      BleApplicationContext.EndDevice_Connection_Status[0] != APP_BLE_CONNECTING)
  {
    /* USER CODE BEGIN APP_BLE_CONNECTED_SUCCESS_END_DEVICE_1 */

    /* USER CODE END APP_BLE_CONNECTED_SUCCESS_END_DEVICE_1 */
    result = aci_gap_create_connection(SCAN_P,
                                       SCAN_L,
                                       P2P_SERVER1_ADDR_TYPE,
                                       P2P_SERVER1_BDADDR,
                                       CFG_BLE_ADDRESS_TYPE,
                                       0x000C,   /* conn interval min = 15 ms (ActiveLook prefers 15-30) */
                                       0x0018,   /* conn interval max = 30 ms */
                                       0,
                                       SUPERV_TIMEOUT,
                                       CONN_L1,
                                       CONN_L2);

    FS_BleDiag_Log("ENGO connect cmd=0x%02X type=%u addr=%02X:%02X:%02X:%02X:%02X:%02X",
                   (unsigned) result, (unsigned) P2P_SERVER1_ADDR_TYPE,
                   P2P_SERVER1_BDADDR[5], P2P_SERVER1_BDADDR[4],
                   P2P_SERVER1_BDADDR[3], P2P_SERVER1_BDADDR[2],
                   P2P_SERVER1_BDADDR[1], P2P_SERVER1_BDADDR[0]);

    if (result == BLE_STATUS_SUCCESS)
    {
      /* USER CODE BEGIN BLE_STATUS_END_DEVICE_1_SUCCESS */

